app/views/users/show.html.erb


			<% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"