app/views/events/index.html.erb

			<th><%= event.datetime %></th>
			<th><%= User.find_by(id: event.creator_id).name %></th>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]