app/views/events/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
		<tr>
			<% if current_user == User.find(@event.creator_id) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
				<th><%= user.name %></th>
				<% if current_user == User.find(@event.creator_id) %>