app/controllers/events_controller.rb

  def index
    @event = Event.all.map { |event| event }
---
SELECT "events".* FROM "events"

  def create
  	@event = Event.create(description: params[:event][:description], datetime: params[:event][:datetime], place: params[:event][:place])
    @event.creator = current_user
  	@event.save
---
INSERT INTO "events" ("description", "datetime", "place", "creator_id") VALUES (?, ?, ?, ?)  [["description", "jack party"], ["datetime", "2018-06-01 00:00:00"], ["place", "trabendo"], ["creator_id", 3]]
INSERT INTO "events" ("description", "datetime", "place", "creator_id") VALUES (?, ?, ?, ?)  [["description", "Event 1"], ["datetime", "2018-05-23 00:00:00"], ["place", "Mystere"], ["creator_id", 3]]

  def subscribe
    @event = Event.find(params[:id])
    @event.attendees << current_user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "event_attendees" ("event_id", "attendee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 7], ["attendee_id", 1], ["created_at", "2018-05-03 20:26:10.916320"], ["updated_at", "2018-05-03 20:26:10.916320"]]

  def invitation
    @event = Event.find(params[:id])
    my_user = User.find(params[:user])
    @event.attendees << my_user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "event_attendees" ("event_id", "attendee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 7], ["attendee_id", 3], ["created_at", "2018-05-03 20:26:43.510772"], ["updated_at", "2018-05-03 20:26:43.510772"]]