app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    user = User.find_by(id: params[:session][:id])