app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events"
---
  def show
  	@user = User.find(params[:id])
    @event = []
    Event.all.each do |event|

INSERT INTO "users" ("name") VALUES (?)  [["name", "bla"]]
---
  def create
  	@user = User.create(name: params[:user][:name])